<template>
    <div class = "content">
        <header-text>Ticket to ride</header-text>
        <div class = "picture"></div>
        <div>
            <div>🧑 2-5 игроков</div>
            <div>⏳ 30-60 минут</div>
            <div>8 ✚</div>
        </div>
        <div>Настоящий железнодорожный магнат всегда должен стремиться не только к созданию и укреплению своей империи, но и заботиться о конкурентах. Необходимо прокладывать самые длинные и самые эффективные маршруты, не забывая отсекать оппонентов от важных транспортных узлов. Главное – сохранить баланс между жадностью и умеренностью: долгие утомительные переезды конечно приносят прибыль, но за быстрое прибытие в желанный пункт назначения многие готовы серьезно раскошелиться…</div>
        <a>
            <span>♞</span>
            <span>Правила игры</span>
        </a>
    </div>
</template>

<script>
    export default {
        name: "GameDialog",
        components: {}
    }
</script>

<style scoped>
    .picture {
        background-color: lightgray;
        width: 100%;
        height: 150px;
        margin-bottom: 1.5rem;
    }
    .content > div:nth-child(3) {
        display: flex;
        gap: 1rem;
        margin-bottom: 1.5rem;
    }
    .content > div:nth-child(4) {
        padding-bottom: 1.5rem;
    }
    a {
        cursor: pointer;
    }
    a:hover {
        color: teal;
    }
</style>