<template>
    <div>
        <div
            class = "header"
            @click = "showRules"
        >
            <div>Онакомиться со всеми правилами</div>
            <div>▼</div>
        </div>
        <div
            class = "text"
            v-show="isShow"
        >
            Этот документ имеет статус официальной письменной публичной оферты в соответствии со статьей 437 Гражданского кодекса РФ.
            <br>Предметом договора (услугой) является посещение и аренда помещения в сети антикафе Time Cafe по тарифам указанным на сайте https://timecafe.ru/.
            <br>Договор считается заключенным с момента начала посещения клуба. Посещение клубов сети Time Cafe означает ваше согласие с условиями оферты (акцепт). Если в оферту были внесены изменения, обновленные условия оферты принимаются (акцептуются) гостем при следующем посещении клуба.
            <br>
            <br><strong>Общие понятия:</strong>
            <br>1.1. Клуб — любой клуб сети антикафе Time Cafe.
            <br>1.2. Гость — любой посетитель клуба и/или держатель клубной карты. Все гости являются клиентами.
            <br>1.3. Браслет — бумажный цветной браслет с логотипом Time Cafe, которым отмечается
            <br>человек, находящийся в Time Cafe во время аренды помещения.
            <br>1.4. Посещением и следовательно принятием (акцептом) оферты считается любое пребывание гостя в клубе (по клубной карте, гостевой карте, во время аренды, по браслету, на мероприятии).
            <br>
            <br><strong>Правила сети Time Cafe:</strong>
            <br>2.1. Гость не вправе подарить, продать, передать свою клубную карту другому человеку. Но в случае если гость получил апгрейд (повышение) клубной карты, он может подарить старую клубную карту другому человеку (безвозмездно).
            <br>2.2. Приходя в Time Cafe гости проводят карту через сканер на входе и через второй сканер на выходе.
            <br>2.3. Гости снимают верхнюю одежду и обувь, надевают тапочки или одноразовые носочки.
            <br>2.4. Гости относят грязную посуду в раковину, кладут вещи на место.
            <br>2.5. Гости уважительно относятся к другим гостям клуба.
            <br>2.6. Гости не используют мат на территории клуба.
            <br>2.7. На территории клуба запрещены алкоголь, наркотики, курение, азартные игры, секс.
            <br>2.8. При нарушении внутренних правил Time Cafe вправе забрать у гостя клубную карту и заблокировать профиль гостя во всех клубах сети. При серьезном или неоднократном нарушении правил гость возмещает причиненный ущерб.
            <br>
            <br><strong>Согласие на сбор и обработку персональных данных:</strong>
            <br>3.1. Гость соглашается на сбор и обработку его персональных данных на основании ФЗ № 152-ФЗ «О персональных данных» от 27.07.2006 г.
            <br>3.2. Согласие дается на обработку персональных данных как без использования средств автоматизации (анкеты), так и с их использованием, включая сбор, хранение, уточнение (обновление, изменение), использование, передачу (в том числе передачу третьим лицам, не исключая трансграничную передачу, если необходимость в ней возникла в ходе исполнения обязательств, предоставления услуги), блокирование персональных данных. Данные могут быть указаны при заполнении анкеты, на сайте timecafe.ru, переданы по электронной почте и другими способами.
            <br>3.3. Под персональными данными понимается любая информация личного характера, позволяющая установить личность: ФИО, номер телефона, электронная почта, дата рождения, профили социальных сетей, информация о месте учебы; фото- и видеоматериалы, записи телефонных разговоров; сведения о почтовом клиенте, используемом браузере, переходах по ссылкам в электронных письмах, местоположении, IP-адресах, с которых пользователь открывает электронное письмо.
            <br>3.3. Time Cafe обрабатывает персональные данные гостя в следующих целях: предоставление услуг, организацию программы лояльности (для процедуры начисления, учета и расходования бонусов), распространение информационных и рекламных сообщений (по SMS, электронной почте, телефону, иным средствам связи), получение обратной связи.
            <br>3.4. Гость соглашается на фото- и видеосъемку, которую проводят сотрудники клуба, а также камеры видеонаблюдения. Гость соглашается на размещение фото и видео на сайте и в соцсетях Time Cafe.
            <br>3.5. Гость в любой момент может в письменном виде отказаться от SMS и e-mail
            <br>рассылки, от обработки его персональных данных, а также попросить изъять материалы с его участием из общего доступа на интернет ресурсах. Подобные обращения рассматриваются в течение 7 дней с момента получения письма на почту info@timecafe.ru.
            <br>Редакция от 19.04.2019
            <br>
            <br><strong>Исполнитель</strong>
            <br>ООО «Тайм кафе»
            <br>ОГРН: , ИНН: , КПП:
            <br>р/c No  — в АО «АЛЬФА-БАНК» г. Москва
            <br>БИК:  / Кор. Счет No
        </div>
    </div>
</template>

<script>
    export default {
        name: "RulesMain",
        data() {
            return {
                isShow: false
            }
        },
        methods: {
            showRules() {
                this.isShow = !this.isShow;
            }
        }
    }
</script>

<style scoped>
    .header {
        display: flex;
        background-color: lightgray;
        align-items: center;
        padding: 1rem 1.5rem;
        margin-bottom: 60px;
        cursor: pointer;
    }
    .header:hover {
        color: teal;
    }
    .header > div:nth-child(1) {
        flex: auto;
    }
    .header > div:nth-child(2) {
        flex: none;
    }
    .text {
        margin-top: -30px;
        margin-bottom: 60px;
    }
</style>