<template>
    <div class = "about">
        <div>
            <br>Time Cafe — это как дом твоего лучшего друга, в который ты можешь прийти независимо от времени суток и настроения. Тут тепло, уютно и тебе всегда рады.
            <br>
            <br>Мы — сеть антикафе в центре Москвы. Time Cafe всегда работал и будет работать круглосуточно и без выходных.
            <br>
            <br>В каждом нашем клубе есть пространство для большой компании или же для двоих. Есть общий зал, где можно познакомиться с интересными людьми, а есть отдельные комнаты и уютные диваны, на которых можно поработать.
        </div>
        <div>
            <br><strong>Всегда бесплатно:</strong>
            <br>
            <br>Чай, кофе, печенье. А также молоко, мёд, приправы, сиропы, тосты, варенье и многое другое.
            <br>Вы платите только за время.
        </div>
    </div>
</template>

<script>
    export default {
        name: "AboutInfo"
    }
</script>

<style scoped>
    .about {
        padding-bottom: 48px;
    }
    .about > div:not(:last-child) {
        padding-bottom: 24px;
    }
</style>